[
  {
    "id": "/Users/ak/applypal/utils/sources/cleaned_text_parsed/webpages/www_utwente_nl__en_education_master_admission_requirements_.txt",
    "hash": "e6cb9bb1a1cdbc30b4a6680034d870db",
    "country": "General",
    "category": "work",
    "source": "https://www.utwente.nl/en/education/master/admission-requirements/",
    "type": "web",
    "content": "# Source: https://www.utwente.nl/en/education/master/admission-requirements/\n\nInternational degree | Admission requirements | MSc University of Twente Skip to main content Menu en Nederlands English Deutsch LatAm website Italian website Home Education Master Admission requirements You can do a master's if you are at an academic level . See if you are! Dutch Educational System The Dutch higher education is based on a binary system that distinguishes: Research-oriented higher education, which is mainly provided at research universities (WO Bachelor). Higher professional education, which is mainly provided at universities of applied sciences (HBO Bachelor). Being a research university , UT will focus on academically oriented work. That is why the admission committee assesses your prior education to see whether it corresponds with a bachelor's degree from a Dutch research university. Keep in mind that if you have a bachelor’s degree from a country where there is no binary system, it may di"
  },
  {
    "id": "/Users/ak/applypal/utils/sources/cleaned_text_parsed/webpages/www_universityadmissions_se__intl_start.txt",
    "hash": "d2e64a056d406fec00431ec2d5ebd369",
    "country": "General",
    "category": "admission",
    "source": "https://www.universityadmissions.se/intl/start",
    "type": "web",
    "content": "# Source: https://www.universityadmissions.se/intl/start\n\nUniversityadmissions.se - Apply to Swedish universities Apply to courses and programmes in all of Sweden Autumn 2025 Spring 2026 Summer 2026 Autumn 2026 Semester (Optional) Courses and programmes Find courses Find courses & programmes Apply to master's Find detailed, step-by-step instructions on how to complete and submit an application for master's studies in Sweden. Apply to bachelor's If you're interested in bachelor's studies, find step-by-step instructions on how to apply to University Admissions. Dates and deadlines A successful admissions process means meeting deadlines. Find out all the important dates for your application. Starting the admissions process? Take a look at our guide to what you need to do, when - and where Your most frequently asked questions What are the deadlines for submitting my transcripts and English test results, and when will I get my admissions decision? All admission rounds have their own special"
  },
  {
    "id": "/Users/ak/applypal/utils/sources/cleaned_text_parsed/webpages/studyinsweden_se__.txt",
    "hash": "30331ed7f91b044a34e7df36a87d10db",
    "country": "Sweden",
    "category": "study",
    "source": "https://studyinsweden.se/",
    "type": "web",
    "content": "# Source: https://studyinsweden.se/\n\nStudy in Sweden - Live and learn the Swedish way ✌️ ✌️ live & learn the swedish way Play animation Find your dream programme Popular right now Applications are open 🎉 Learn how to apply Get insider tips straight to your inbox Learn more The Swedish Way ✌️ Sign up for our newsletter Get tips, deadlines and student life updates straight to your inbox ✌️ Quiz Is studying in Sweden right for you? Take our quiz and find out now ↗️ From the Blog 👉 Everything you need to know to apply to Study in Sweden Straight from Sweden Meet the students who are already here Sign up for our newsletter Get tips, deadlines and student life updates straight to your inbox ✌️"
  },
  {
    "id": "/Users/ak/applypal/utils/sources/cleaned_text_parsed/webpages/vu_nl__en_education_more_about_apply_masters_programme.txt",
    "hash": "e0c9ddc8e47dc5e1dfb0428c15af0548",
    "country": "General",
    "category": "work",
    "source": "https://vu.nl/en/education/more-about/apply-masters-programme",
    "type": "web",
    "content": "# Source: https://vu.nl/en/education/more-about/apply-masters-programme\n\nHow do I apply for a Master’s programme? - Vrije Universiteit Amsterdam Education Research Current About VU Amsterdam NL Login as Prospective student Student Employee Bachelor Master VU for Professionals Exchange programme VU Amsterdam Summer School Honours programme VU-NT2 Semester in Amsterdam PhD at VU Amsterdam Research highlights Prizes and distinctions Research institutes Our scientists Research Impact Support Portal Creating impact News Events calendar Elections 2025 Israël and Palestinian regions Culture on campus Practical matters Mission and core values Entrepreneurship on VU Campus Organisation Partnerships Alumni University Library Working at VU Amsterdam Sorry! De informatie die je zoekt, is enkel beschikbaar in het Engels. This programme is saved in My Study Choice. Something went wrong with processing the request. Something went wrong with processing the request. How do I apply for a Master’s progra"
  },
  {
    "id": "/Users/ak/applypal/utils/sources/cleaned_text_parsed/webpages/www_eda_admin_ch__countries_usa_en_home_visa_residency_studying_html.txt",
    "hash": "978983df431e3b10db2773c6177d0ffe",
    "country": "USA",
    "category": "visa",
    "source": "https://www.eda.admin.ch/countries/usa/en/home/visa/residency/studying.html",
    "type": "web",
    "content": "# Source: https://www.eda.admin.ch/countries/usa/en/home/visa/residency/studying.html\n\nStudying in Switzerland Home Visa & entry to Switzerland Living in Switzerland Studying in Switzerland Print page Studying in Switzerland In order to be able to study in Switzerland you require a proof of acceptance from the education institution where you will be studying. Depending on your nationality, with this letter you can either apply for a residence permit in a Swiss canton or submit a visa application to the Swiss representation covering your country of residence. Students at the Rolex Learning Centre library, Ecole polytechnique fédérale de Lausanne. © FDFA, Presence Switzerland Apply for Admission Contact the school or university of your choice prior to the admission deadline. Most of the universities also accept online applications. The main documents that you will have to send to the university are your upper secondary school-leaving certificate (the original or a notarized copy) and an "
  },
  {
    "id": "/Users/ak/applypal/utils/sources/cleaned_text_parsed/webpages/www_studyprogrammes_ch__en.txt",
    "hash": "360db8f8cb2687bb5a0c6597a0d884f6",
    "country": "General",
    "category": "study",
    "source": "https://www.studyprogrammes.ch/en?query=&institute=&institute_kind=&degree_level=&areas_of_study=&study_languages=&study_languages_exclusivity=false&order_by=&order_by_direction=&page=1&cantons=&language_regions=",
    "type": "web",
    "content": "# Source: https://www.studyprogrammes.ch/en?query=&institute=&institute_kind=&degree_level=&areas_of_study=&study_languages=&study_languages_exclusivity=false&order_by=&order_by_direction=&page=1&cantons=&language_regions=\n\nstudyprogrammes.ch"
  },
  {
    "id": "/Users/ak/applypal/utils/sources/cleaned_text_parsed/webpages/www_universiteitleiden_nl__en_education_admission_and_application_masters.txt",
    "hash": "2499deaf9d2159e559fae52c47c47293",
    "country": "General",
    "category": "tuition",
    "source": "https://www.universiteitleiden.nl/en/education/admission-and-application/masters",
    "type": "web",
    "content": "# Source: https://www.universiteitleiden.nl/en/education/admission-and-application/masters\n\nMaster's admission and application - Leiden University Skip to main content Master's admission and application Find out how to apply for one of Leiden University’s master's programmes by following our step-by step guide in the application and admission section. We look forward to receiving your application! Step-by step guide This guide clearly explains the steps you need to take to apply, and the subsequent admission process. Step 1: Check the admission requirements Step 2: Check the application deadlines Step 3: Collect the required documents Step 4: Start your application Step 5: Pay your tuition fees Step 6: Prepare for your studies at Leiden University Every programme at Leiden University has its own entry requirements, application procedure and deadlines. Find out how to apply for your programme by following the step-by step guide in the application and admission section of each programme "
  },
  {
    "id": "/Users/ak/applypal/utils/sources/cleaned_text_parsed/webpages/studyinsweden_se__subjects_.txt",
    "hash": "33355571bc1df6e5e526c7af81c11575",
    "country": "Sweden",
    "category": "study",
    "source": "https://studyinsweden.se/subjects/",
    "type": "web",
    "content": "# Source: https://studyinsweden.se/subjects/\n\nStudy programmes - Study in Sweden Study programmes Choose between finding study programmes through subject areas or universities. Filter Subject areas Universities Found 17 subject areas Agriculture, Horticulture, Forestry and Fishery Forests. Fish. Wildlife. They’re pretty important to us – and to the planet, as it goes. Here in Sweden, we’re in love with our environment, and we’re fiercely protective of it. That’s why we give students who share our passion for a sustainable future the know-how they need to start shaping it. Just take a look around. Acres and acres (and acres) of lush greenery, dotted with literally thousands of lakes. Added to that: an appetite for innovation in Agriculture, Horticulture, Forestry and Fishery that you won’t find anywhere else. Who says you have to focus on one specialism? Not us! Want to study Economics AND Policy Analysis with a double Master’s degree? Gain in-depth knowledge of wildlife conservation wh"
  }
]